I can repro this if I create the same `timeouts` block in my statefile. That's very weird- thanks for catching this!

```
  # google_secret_manager_secret_version.secret-version-basic must be replaced
-/+ resource "google_secret_manager_secret_version" "secret-version-basic" {
      ~ create_time            = "2025-04-02T21:42:25.977188Z" -> (known after apply)
      + destroy_time           = (known after apply)
      ~ id                     = "projects/482878270665/secrets/secret-version/versions/1" -> (known after apply)
      ~ name                   = "projects/482878270665/secrets/secret-version/versions/1" -> (known after apply)
      + secret_data_wo_version = 0 # forces replacement
      ~ version                = "1" -> (known after apply)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }
```

@BBBmau could you try investigating why timeouts could have drifted? I suspect a core/SDK issue since I don't think we have control over it. I don't love that users would need to do state surgery to correct a bug like this, and I don't think it's specific to the WO field- it may be triggered by any new field we don't set in Read, in theory, I think?